---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarBendData.HookLength0
source: html/73f8ee06-a9c1-a869-fcd0-6e1de91eacc9.htm
---
# Autodesk.Revit.DB.Structure.RebarBendData.HookLength0 Property

The extension length of the hook at the start.

## Syntax (C#)
```csharp
public double HookLength0 { get; set; }
```